Repository: maunutatu/job-app
Catalog: app/Jobitti/Resources/Localizable.xcstrings
Source language: en
Languages: fi

# application.coverLetter
source: Cover letter
fi: Saatekirje

# application.sentDate
source: Sent on %@
fi: Lähetetty %@

# application.status
source: Status
fi: Tila

# application.status.sent
source: Sent
fi: Lähetetty

# applications.noApplications
source: No applications yet 😐
fi: Ei avoimia työhakemuksia 😐

# applications.noneSelected
source: Select an application
fi: Valitse työhakemus

# applications.notLoggedIn
source: Log in to view your job applications 🔐
fi: Kirjaudu sisään nähdäksesi työhakemukset 🔐

# applications.title
source: My applications
fi: Työhakemukset

# common.cancel
source: Cancel
fi: Peruuta

# common.done
source: Done
fi: Valmis

# error.http
source: HTTP %d from %@
fi: HTTP %d osoitteesta %@

# error.title
source: I broke down 😭
fi: Rikki meni 😭

# filters.activeCount
source: %d filters selected
fi: %d aktiivista suodatinta

# filters.clearButton
source: Clear all
fi: Nollaa kaikki

# filters.employmentType
source: Employment type
fi: Työsuhteen tyyppi

# filters.field
source: Field
fi: Ala

# filters.location
source: Location
fi: Sijainti

# filters.schedule
source: Schedule
fi: Työaika

# job.alreadyApplied
source: You have applied for this job ✅
fi: Olet lähettänyt hakemuksen tähän työpaikkaan ✅

# job.applyButton
source: Apply now
fi: Lähetä hakemus

# job.coverLetter
source: Cover letter:
fi: Saatekirje:

# job.filterButton
source: Filters
fi: Suodata

# job.noneSelected
source: Select a job
fi: Valitse työpaikkailmoitus

# job.noResults
source: No results 😟
fi: Ei hakutuloksia 😟

# job.noSkillsForUser
source: No skills listed in your profile
fi: Profiilissasi ei ole taitoja

# job.notLoggedIn
source: Log in to submit an application
fi: Kirjaudu sisään lähettääksesi työhakemuksen

# job.postedAt
source: Posted: %@
fi: Julkaistu %@

# job.relevantSkillsTitle
source: Relevant skills:
fi: Soveltuvat taidot:

# job.schedule
source: Schedule: %@
fi: Työaika: %@

# job.schedule.flexible
source: Flexible
fi: Joustava

# tab.applications
source: Applications
fi: Hakemukset

# tab.jobs
source: Jobs
fi: Työpaikat

# tab.user
source: Me
fi: Minä

# user.addSkill
source: Add skill
fi: Lisää

# user.dateOfBirth
source: Date of birth
fi: Syntymäpäivä

# user.education
source: Education
fi: Koulutus

# user.educationPlaceholder
source: B.Sc. (Tech)
fi: TkK

# user.email
source: Email
fi: Sähköposti

# user.emailPlaceholder
source: name@example.com
fi: nimi@example.com

# user.experience
source: Experience
fi: Työkokemus

# user.experiencePlaceholder
source: 2 years of programming
fi: 2 vuotta ohjelmointia

# user.firstName
source: First name
fi: Etunimi

# user.firstNamePlaceholder
source: John
fi: Maija

# user.lastName
source: Last name
fi: Sukunimi

# user.lastNamePlaceholder
source: Doe
fi: Meikäläinen

# user.login
source: Log in
fi: Kirjaudu

# user.loginButton
source: Log in
fi: Kirjaudu

# user.loginSubtitle
source: Or register by entering your info below:
fi: Tai rekisteröidy syöttämällä tiedot alle:

# user.logoutButton
source: Log out
fi: Kirjaudu ulos

# user.logoutSubtitle
source: Your user ID: %d
fi: Käyttäjänumerosi: %d

# user.personalInfoHeader
source: Personal info
fi: Henkilötiedot

# user.phoneNumber
source: Phone number
fi: Puhelinnumero

# user.professionalDetailsHeader
source: Professional details
fi: Osaaminen

# user.saveButton
source: Save
fi: Tallenna

# user.savingFailed
source: Failed to save (%@)
fi: Tallennus epäonnistui (%@)

# user.skillPlaceholder
source: What are you good at?
fi: Missä olet hyvä?

# user.skills
source: Skills
fi: Taidot

# user.userId
source: Your user ID
fi: Käyttäjänumerosi
